# -*- coding: utf-8 -*-
"""

    Практическая работа 2. номер зачетной книжки 21-702
    Автор: Федоров Артем Андреевич
    Дата:26.01.2022

    Задание 2:Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое число записано в отдельной строке. Формула площади треугольника: 1/2 * a*b
"""

a = int(input("введите число:"))
b = int(input("введите число:"))
print (1/2*a*b)