# -*- coding: utf-8 -*-
"""

    Практическая работа 1. номер зачетной книжки 21-702
    Автор: Федоров Артем Андреевич
    Дата:26.01.2022

    Задание 2:Вывести на экран остаток от деления 16823 * 12302 / 3092.
"""
print (16823*12302 % 3092)
