# -*- coding: utf-8 -*-
"""

    Практическая работа 1. номер зачетной книжки 21-702
    Автор: Федоров Артем Андреевич
    Дата:26.01.2022

    Задание 6:Поменяйте значения переменных x и y местами.
"""
print('введите число X')
x = input()
print('введите число Y')
y = input()
print ('X = ', x)
print ('Y =', y)
z = x
x = y
y = z
print ('числа после перестановки знвчений ')
print ('X = ', x)
print ('Y =', y)
